emacs/.config/emacs/emacs.org
#+TITLE: emacs.org - Configuration File For GNU Emacs
#+AUTHOR: Leon Schulz
#+STARTUP: showeverything

* =emacs.org= - Configuration File For GNU Emacs

** General Setttings

*** Basics

Enable Relative Line Numbers
#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode 1)
#+END_SRC

Set Tab Width To Four Spaces
#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
#+END_SRC

Don't Wrap Lines
#+BEGIN_SRC emacs-lisp
(setq-default truncate-lines nil)
#+END_SRC

Enable Cursorline
#+BEGIN_SRC emacs-lisp
(global-hl-line-mode 1)
#+END_SRC

Better Selections
#+BEGIN_SRC emacs-lisp
(delete-selection-mode 1)
#+END_SRC

Autopairs
#+BEGIN_SRC emacs-lisp
(electric-pair-mode 1)
#+END_SRC

*** UI Settings

Disable Unnecessary UI-Elements
#+BEGIN_SRC emacs-lisp
(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)
(tooltip-mode 0)
#+END_SRC

Disable Startup Screen
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-screen t)
(setq initial-scratch-message "")
#+END_SRC

Make Background Transparent
#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist '(alpha-background . 90))
#+END_SRC

Set Fontface To JetBrains Mono
#+BEGIN_SRC emacs-lisp
(set-frame-font "JetBrains Mono 10" nil t)
#+END_SRC

*** Scrolling Behaviour

Reproduce Vim Scrolling Behaviour
#+BEGIN_SRC emacs-lisp
(setq scroll-conservatively 10000)
#+END_SRC

Preserve Screen Position When Scrolling With The Mouse
#+BEGIN_SRC emacs-lisp
(setq scroll-preserve-screen-position 'always)
#+END_SRC

Only Scroll One Line At A Time -> Smoother Scrolling
#+BEGIN_SRC emacs-lisp
(setq scroll-step 1)
#+END_SRC

Set Scrolloff To Four Lines
#+BEGIN_SRC emacs-lisp
(setq scroll-margin 4)
#+END_SRC

*** Backups And Autosaves

Disable Autosaves And Backups So That Emacs Stops Filling
Up Your Directories With A Ton Of Bullshit :D
#+BEGIN_SRC emacs-lisp
(setq auto-save-mode 0)
(setq make-backup-files nil)
#+END_SRC

*** Balanced Windows

#+BEGIN_SRC emacs-lisp
(setf window-combination-resize t)
#+END_SRC

*** Miscellaneous

Stop Emacs From Editing Your Configuration File
#+BEGIN_SRC emacs-lisp
(setq disabled-command-function nil)
#+END_SRC

Delete Trailling Whitespace On Save
#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook 'whitespace-cleanup)
#+END_SRC

Wrap Around In Minibuffer Doing Completions
#+BEGIN_SRC emacs-lisp
(setq completion-auto-wrap t)
#+END_SRC

** Package Managment

Add MELPA Stable To Package Repositories
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives
             '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)
#+END_SRC

Make Sure That The `use-package' Macro Is Installed
#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
#+END_SRC

** Colorscheme

#+BEGIN_SRC emacs-lisp
(add-to-list 'custom-theme-load-path "~/.config/emacs/colors")
(load-theme 'everforest-hard-dark t)
#+END_SRC

** Keybindings

*** Window Managment

| COMMAND                   | CUSTOM KEYBINDING | DEFAULT KEYBINDING |
|---------------------------|-------------------|--------------------|
| split-window-vertically   | C-c w s           | C-x 3              |
| split-window-horizontally | C-c w v           | C-x 2              |
| delete-window             | C-c w k           | C-x 0              |
| delete-other-windows      | C-c w z           | C-x 1              |
| other-window              | C-c o / C-c C-o   | C-x o              |

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c w s") 'split-window-vertically)
(global-set-key (kbd "C-c w v") 'split-window-horizontally)
(global-set-key (kbd "C-c w k") 'delete-window)
(global-set-key (kbd "C-c w z") 'delete-other-windows)
(global-set-key (kbd "C-c o")   'other-window)
(global-set-key (kbd "C-c C-o") 'other-window)
#+END_SRC

*** Text Selection

| COMMAND                    | CUSTOM KEYBINDING | DEFAULT KEYBINDING |
|----------------------------|-------------------|--------------------|
| mark-paragraph             | C-c p             | M-h                |
| toggle-rectangle-selection | C-c r             | C-x SPC            |
| toggle-selection           | C-SPC             | C-SPC              |

#+BEGIN_SRC emacs-lisp
(defun toggle-selection()
  (interactive)
  (if mark-active
      (keyboard-escape-quit)
    (set-mark (point))))

(defun toggle-rectangle-selection()
  (interactive)
  (if mark-active
      (keyboard-escape-quit)
    (rectangle-mark-mode)))

(global-set-key (kbd "C-SPC") 'toggle-selection)

(global-set-key (kbd "C-c p") 'mark-paragraph)
(global-set-key (kbd "C-c r") 'toggle-rectangle-selection)
#+END_SRC

*** Moving Lines

| COMMAND        | CUSTOM KEYBINDING | DEFAULT KEYBINDING |
|----------------|-------------------|--------------------|
| move-line-up   | M-p               |                    |
| move-line-down | M-n               |                    |

#+BEGIN_SRC emacs-lisp
(defmacro save-column(&rest body)
  `(let ((column (current-column)))
     (unwind-protect
         (progn ,@body)
       (move-to-column column))))
(put 'save-column 'lisp-indent-function 0)

(defun move-line-up()
  (interactive)
  (save-column
    (transpose-lines 1)
    (forward-line -2)))

(defun move-line-down()
  (interactive)
  (save-column
    (forward-line 1)
    (transpose-lines 1)
    (forward-line -1)))

(global-set-key (kbd "M-p") 'move-line-up)
(global-set-key (kbd "M-n") 'move-line-down)
#+END_SRC

*** Other Keybindings

| COMMAND      | CUSTOM KEYBINDING | DEFAULT KEYBINDING |
|--------------|-------------------|--------------------|
| repeat       | C-.               | C-x z              |
| comment-line | C-,               | C-x C-;            |
| undo-redo    | C--               | C-?                |

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-.") 'repeat)

(global-set-key (kbd "C-,") 'comment-line)

(global-set-key (kbd "C--") 'undo-redo)
(global-set-key (kbd "C-_") 'undo)
#+END_SRC

** Fuzzy Finding

#+BEGIN_SRC emacs-lisp
(use-package ivy
  :ensure t
  :diminish
  :init
  (ivy-mode 1)
  :custom
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  :bind
  (("C-u" . ivy-switch-buffer)))
#+END_SRC

** Language Support

Modes For Certain Programming / Scripting Languages
#+BEGIN_SRC emacs-lisp
(use-package go-mode
  :ensure t)
(use-package lua-mode
  :ensure t)
(use-package yaml-mode
  :ensure t)
(use-package markdown-mode
  :ensure t)
(use-package rust-mode
  :ensure t)
(use-package csharp-mode
  :ensure t)
(use-package dockerfile-mode
  :ensure t)
(use-package haskell-mode
  :ensure t)
(use-package python-mode
  :ensure)
#+END_SRC

** Org Mode

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'org-indent-mode)

(add-hook 'org-mode-hook (lambda () (electric-indent-mode 0)))

(use-package org-modern
  :ensure t
  :config
  (global-org-modern-mode 1))

(custom-set-faces
  '(org-level-1 ((t (:inherit outline-1 :height 1.6))))
  '(org-level-2 ((t (:inherit outline-2 :height 1.4))))
  '(org-level-3 ((t (:inherit outline-3 :height 1.2))))
  '(org-level-4 ((t (:inherit outline-4 :height 1.1))))
  '(org-level-5 ((t (:inherit outline-5 :height 1.0))))
)
#+END_SRC

** Dired

#+BEGIN_SRC emacs-lisp
(add-hook 'dired-mode-hook #'dired-hide-details-mode)

(use-package all-the-icons
  :ensure t)

(use-package all-the-icons-dired
  :ensure t
  :config
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
#+END_SRC
